In [1]:
import pandas as pd

In [2]:
pd.__version__

'1.3.2'

In [3]:
data_dict = {"COL": 1000, "MX": 5000, "USD": 10000}

In [4]:
pd.Series(data_dict)

COL     1000
MX      5000
USD    10000
dtype: int64

In [5]:
data_dict = {"COL": [10, 20, 30], "USD": [46, 78, 87], "MX": [12, 34, None]}

In [6]:
df = pd.DataFrame(data_dict)
df

   COL  USD    MX
0   10   46  12.0
1   20   78  34.0
2   30   87   NaN

In [7]:
df.isna()

     COL    USD     MX
0  False  False  False
1  False  False  False
2  False  False   True

In [8]:
dict_data = {
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}
dict_data

NameError: name 'np' is not defined

In [9]:
import numpy as np

In [10]:
dict_data = {
    'edad' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'pais' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genero' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}
dict_data

{'edad': [10, 9, 13, 14, 12, 11, 12],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'pais': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
 'genero': ['M', 'F', 'F', 'M', 'M', 'M', 'F'],
 'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9.0]}

In [12]:
df = pd.DataFrame(dict_data, index=['Ana', 'Pedro', 'Juan', 'Anlo', 'Nando', 'Dani', 'Randy'])
df

       edad   cm pais genero    Q1   Q2
Ana      10  115   co      M   5.0  7.0
Pedro     9  110   mx      F  10.0  9.0
Juan     13  130   co      F   8.0  9.0
Anlo     14  155   mx      M   NaN  8.0
Nando    12  125   mx      M   7.0  8.0
Dani     11  120   ch      M   8.0  8.0
Randy    12  125   ch      F   3.0  9.0

In [13]:
df.index

Index(['Ana', 'Pedro', 'Juan', 'Anlo', 'Nando', 'Dani', 'Randy'], dtype='object')

In [14]:
df.columns

Index(['edad', 'cm', 'pais', 'genero', 'Q1', 'Q2'], dtype='object')

In [15]:
df.values

array([[10, 115, 'co', 'M', 5.0, 7.0],
       [9, 110, 'mx', 'F', 10.0, 9.0],
       [13, 130, 'co', 'F', 8.0, 9.0],
       [14, 155, 'mx', 'M', nan, 8.0],
       [12, 125, 'mx', 'M', 7.0, 8.0],
       [11, 120, 'ch', 'M', 8.0, 8.0],
       [12, 125, 'ch', 'F', 3.0, 9.0]], dtype=object)

In [17]:
df['edad']

Ana      10
Pedro     9
Juan     13
Anlo     14
Nando    12
Dani     11
Randy    12
Name: edad, dtype: int64

In [19]:
df[['edad', 'cm', 'Q1']]

       edad   cm    Q1
Ana      10  115   5.0
Pedro     9  110  10.0
Juan     13  130   8.0
Anlo     14  155   NaN
Nando    12  125   7.0
Dani     11  120   8.0
Randy    12  125   3.0

In [23]:
df.loc[['Ana', 'Dani'], ['edad', 'cm', 'Q1']]

      edad   cm   Q1
Ana     10  115  5.0
Dani    11  120  8.0

In [24]:
df.loc['Anlo', 'Q1']

nan

In [25]:
df.loc['Anlo', 'cm']

155

In [26]:
df.iloc[2, 1]

130

In [27]:
df.iloc[:, [1, 2]]

        cm pais
Ana    115   co
Pedro  110   mx
Juan   130   co
Anlo   155   mx
Nando  125   mx
Dani   120   ch
Randy  125   ch

In [28]:
df.iloc[:, :]

       edad   cm pais genero    Q1   Q2
Ana      10  115   co      M   5.0  7.0
Pedro     9  110   mx      F  10.0  9.0
Juan     13  130   co      F   8.0  9.0
Anlo     14  155   mx      M   NaN  8.0
Nando    12  125   mx      M   7.0  8.0
Dani     11  120   ch      M   8.0  8.0
Randy    12  125   ch      F   3.0  9.0

In [29]:
df['edad'] >= 12

Ana      False
Pedro    False
Juan      True
Anlo      True
Nando     True
Dani     False
Randy     True
Name: edad, dtype: bool

In [30]:
df[df['edad'] >= 12]

       edad   cm pais genero   Q1   Q2
Juan     13  130   co      F  8.0  9.0
Anlo     14  155   mx      M  NaN  8.0
Nando    12  125   mx      M  7.0  8.0
Randy    12  125   ch      F  3.0  9.0

In [32]:
# Students with age major or equal to 12 and country col
df[(df['edad'] >= 12) & (df['pais'] == 'co')]

      edad   cm pais genero   Q1   Q2
Juan    13  130   co      F  8.0  9.0

In [33]:
df.query('edad>12')

      edad   cm pais genero   Q1   Q2
Juan    13  130   co      F  8.0  9.0
Anlo    14  155   mx      M  NaN  8.0

In [34]:
df['Q2'] > df['Q1']

Ana       True
Pedro    False
Juan      True
Anlo     False
Nando     True
Dani     False
Randy     True
dtype: bool

In [35]:
df[df['Q2'] > df['Q1']]

       edad   cm pais genero   Q1   Q2
Ana      10  115   co      M  5.0  7.0
Juan     13  130   co      F  8.0  9.0
Nando    12  125   mx      M  7.0  8.0
Randy    12  125   ch      F  3.0  9.0